# Написати програму, яка обчислює кількість цифр у вхідному числі

# Ви маєте дописати код, який рахує кількість цифр у отриманому числі

#class Calculator
  def number_of_digits

    # Змінна, яка отримає значення кількості чисел
    result = 0

    # Просимо ввести довільне число
    puts "Введіть будь ласка довільне число"

    # Зчитуємо це число
    input = gets.chomp

    # Приводимо зчитаний рядок до цілочисельного типу ( to_integer )
    number = input.to_i

    # Алгоритм визначення кількості цифр є наступним
    while (number != 0)
        number = number.to_i/10
            result +=1
    end


    puts result

  end
#end
number_of_digits
